[
	{
	"id":"1",
	"title": "Thanksgiving",
	"body": "Thanksgiving Day, annual national holiday in the United States and Canada celebrating the harvest and other blessings of the past year. Americans generally believe that their Thanksgiving is modeled on a 1621 harvest feast shared by the English colonists (Pilgrims) of Plymouth and the Wampanoag people. The American holiday is particularly rich in legend and symbolism, and the traditional fare of the Thanksgiving meal typically includes turkey, bread stuffing, potatoes, cranberries, and pumpkin pie. With respect to vehicular travel, the holiday is often the busiest of the year, as family members gather with one another. Thanksgiving Day is celebrated on Thursday, November 25, 2021. ",
	"date": "11/24/2021",
	"imgUrl":"happy-thanksgiving-written-on-a-table-surrounded-by-plates-of-food.webp",
    "summary":"Thanksgiving Day, annual national holiday in the United States and Canada celebrating the harvest and other blessings of the past year."
	},
	{
	"id":"2",
	"title": "The Real Reason Why Thanksgiving Is Always on a Thursday",
	"body": "For Americans, the timing of the Thanksgiving holiday — the fourth Thursday in November — can be a blessing or a curse. Get Friday off as well and it’s the rare four-day weekend; go back to work and it’s just a hassle for travel.But, as it turns out, the earliest Thanksgivings in what’s now the United States had very different timing. Crucially, they weren’t just a once-a-year special event.The earliest Thanksgivings in the [American] colonies in the 17th century were called for the purpose of giving thanks for a specific blessing, says Melanie Kirkpatrick, author of Thanksgiving: The Holiday at the Heart of the American Experience and Senior Fellow at the Hudson Institute. Much-needed good weather or a victory in a skirmish with Native Americans — with whom, contrary to the more mythical Thanksgiving story, peace was the exception to the rule — might earn a mention from a colony’s governor, and a special day would be set aside, but when that day fell would obviously depend on what had happened. For example, leaders of the colony of Plymouth, Mass., called for a day of Thanksgiving in 1623 at the end of a severe drought when they felt like their prayers for rain had been answered.",
	"date": "11/22/2021",
	"imgUrl":"happy-thanksgiving-written-on-a-table-surrounded-by-plates-of-food.webp",
    "summary":"For Americans, the timing of the Thanksgiving holiday — the fourth Thursday in November — can be a blessing or a curse."
	},
	{
	"id":"3",
	"title": "Coronavirus: The agonising Thanksgiving dilemma facing millions of Americans",
	"body": "With over a million new Covid-19 cases nationwide in the past week, according to Johns Hopkins University, public health officials are cautioning people not to gather in large groups this holiday season.Next week's Thanksgiving weekend poses a particular concern. Americans traditionally travel home to be with loved ones, taking part in meals, parades and shopping sprees.The Centers for Disease Control and Prevention (CDC) strongly recommended that this year, Americans stay home and celebrate only with those they live with.The nation's top infectious disease expert Dr Anthony Fauci urged Americans to *thinktwice* about holiday travel plans, adding that even *innocent home gatherings*  with family and friends could result in several outbreaks.We asked people from around the country what changes they had made to their Thanksgiving plans and how they felt about 2020's pared-down holiday season.",
	"date": "11/20/2021",
	"imgUrl":"happy-thanksgiving-written-on-a-table-surrounded-by-plates-of-food.webp",
    "summary":"With over a million new Covid-19 cases nationwide in the past week, according to Johns Hopkins University, public health officials are cautioning people not to gather in large groups this holiday season."
	}
	
]